content/posts/wine-and-alternative-music.md
+++
title = "Wine and alternative music"
date = 2020-08-12
lastmod = 2020-08-12T03:10:49+03:00
tags = ["rant"]
categories = ["rants"]
draft = false
weight = 2004
featuredImage = "/images/wine.jpg"
+++

I'm mainly a beer guy, to be completely honest. There are some situations
however, when a good wine could enlighten my spirit in more appropiate ways.
That's how it is when listening to Bauhaus, at 2 AM, alone at home. Other times
I'd feel bad for being a loner like this, but thanks to the internet, and my
keyboard, this is not the case.
The gloomy, gothic athmosphere blends itself well with the fruitiness of the
white Tokaj wine. Wine is the mind palace juice.


## What is beer then? {#what-is-beer-then}

Beer is many things, if you ask me. But it's a drink that needs company, either
in the beauty of other human beings or a good, simple and fulfilling meal, a
home-made carefully prepared burger I suppose.
If you're out at the pub, beer is the way to go. In the summer heat a good
Pilsner or a sophisticated Red Ale soothes the warm waves and sweat and chills
the mind or gives energy and bravery for the last couple of moshpits left of the
festival day.
If there's a party in your house, then it's 50/50 beer or hard liquor, but
mostly cocktails, because we're not barbarians.


## The blood of gods {#the-blood-of-gods}

Wine has a special part in Hungarian culture in general, and we're more of a
wine folk to be completely honest. Our nation has no extensive beer history like
the germanic people, and most of the functions I've described above were
designated to the wine. Weddings, pubs, funeral feasts. We have folk songs about
guarding the grapes, collecting them and enjoying it as well. The best vineyards
are in Hungary though, not in Transylvania, so maybe I could get a pass.
The Greeks thought that only barbarians would drink unwatered the blood of gods,
and we Hungarians most have thought the same, because "fröccs" (watered down
wine) is really prevalent in Hungary. I might be a barbarian then, because I'm
either drinking it as it is, or grab a beer.


## The prestige of wine {#the-prestige-of-wine}

Grape is a sensitive plant, and a good wine needs nurture, experience and
knowledge. Not that beer is trivial, but you could get a decent beer much more
easily, than a drinkable, good wine. That's what primarily gives wine such
prestige, as I presume. This and the general snobism and elitism of the French,
the intellectual and cultural center of Europe, for hundreds of years.


## British post-punk in the mixture {#british-post-punk-in-the-mixture}

This kind of music is very subtle, experimenting, noble and gentle at the same
time. I could describe the experience of drinking wine with similar adjectives,
and many of you might agree with this.
I've been introduced to this kind of music by the dorky but super-smart friend,
which every one us has, and we need to appreciate them more.
The wine part I'm probably faking for the appearance of intellectual superiority
like every snob, but at least I'm admiting it.

Enjoy it while it lasts!
